[
    {
      "id": 1,
      "name": "BOOKI",
      "projectDescription": "Booki est un site permettant aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
      "workDescription": "Ma mission ici était d'implémenter les maquettes Figma des versions desktop, tablette et mobile de la page d'accueil du site Booki avec HTML et CSS. L'adaptation en version tablette et mobile a été la partie la plus challengeante de ce projet.",
      "skillsDescription": "html, css, git / github, responsive",
      "date": "202301",
      "githubLink": "https://github.com/gbourgeron/booki-projet2.git",
      "projectType": "Formation",
      "workType": ["frontend"],
      "image": "imgProjects/booki.jpg"
    },
    {
      "id": 2,
      "name": "SOPHIE BLUEL",
      "projectDescription": "Création du site web de Sophie Bluel, architecte d'intérieur, représentant son portfolio",
      "workDescription": "Ma mission pour ce projet était de créer une page dynamique avec JavaScript en récupérant les données utilisateur, notamment pour la connexion de l'utilisateur, l'affichage des projets dans la gallerie et l'ajout d'un projet via une modale. La modification du DOM en temps réel ainsi l'envoi de données à la BDD ont été challengeant.",
      "skillsDescription": "javascript, html, css, git / github",
      "date": "202302",
      "githubLink": "https://github.com/gbourgeron/projet3-portfolio-architecte-sophie-bluel.git",
      "projectType": "Formation",
      "workType": ["frontend"],
      "image": "imgProjects/bluel.jpg"
    },
    {
      "id": 3,
      "name": "Menu Maker",
      "projectDescription": "Menu Maker by Qwenta est une application permettant aux restaurateurs de créer leurs propres menus directement sur l'application.",
      "workDescription": "Mon travail ici était de préparer la préparation et le développement du site en mettant en place notamment une méthodologie Agile et en présentant le projet au Product Owner. La détermination du temps alloué aux futures tâches fut la partie la plus difficile dans ce projet",
      "skillsDescription": "gestion de projet, agile, notion, trello",
      "date": "202303",
      "projectType": "Formation",
      "workType": ["gestion de projet"],
      "image": "imgProjects/menumaker.jpg"
    },
    {
      "id": 4,
      "name": "Nina Carducci",
      "projectDescription": "Le site de Nina Carducci présente son travail, ses services et sa fiche de contact",
      "workDescription": "Ici la mission était de débuggué plusieurs bugs du site mais aussi optimisé le site et son référencement. La modification des images et de la structure du site, l'optimisation des fichiers et celle du code ont permis de rendre le site totalement optimisé pour les moteurs de recherche.",
      "skillsDescription": "seo, html, css, javascript",
      "date": "202304",
      "githubLink": "https://github.com/gbourgeron/nina-carducci-p5-oc.gitC",
      "siteLink": "https://gbourgeron.github.io/nina-carducci-p5-oc/",
      "projectType": "Formation",
      "workType": ["seo"],
      "image": "imgProjects/carducci.jpg"
    },
    {
      "id": 5,
      "name": "Kasa",
      "projectDescription": "Kasa est un site de réservation de logement en ligne avec pour technologie frontend React.",
      "workDescription": "Mon travail ici était d'implémenter les maquettes Figma des différentes pages du site et du responsive, ceci en utilisant React. La construction de la structure du site et la gestion des routes fut un vrai défi.",
      "skillsDescription": "react, javascript, sass, html, css, git / github, responsive",
      "date": "202305",
      "githubLink": "https://github.com/gbourgeron/kasa-p6-oc.git",
      "projectType": "Formation",
      "workType": ["frontend"],
      "image": "imgProjects/kasa.jpg"
    },
    {
      "id": 6,
      "name": "Mon Vieux Grimoire",
      "projectDescription": "Mon Vieux Grimoire est un site permettant aux utilisateurs d'ajouter leurs livres ainsi que d'y apporter une note et divers informations.",
      "workDescription": "Ma mission était de construire le backend, c'est à dire le serveur et l'api afin de renvoyer au frontend les données récoltées lors d'envoi de requêtes. Il s'agissait également d'assurer la sécurisation de la base de données.",
      "skillsDescription": "nodejs, express, mongodb, git / github",
      "date": "202306",
      "githubLink": "https://github.com/gbourgeron/vieux-grimoire-p7-oc.git",
      "projectType": "Formation",
      "workType": ["backend"],
      "image": "imgProjects/vieuxgrimoire.jpg"
    },
    {
      "id": 7,
      "name": "Portfolio",
      "projectDescription": "Mon site personnel présentant mon profil, mes compétences et mes projets.",
      "workDescription": "J'ai conçu ici l'ensemble du site en utilisant React afin d'étendre les possibilités d'étendre le site dans le futur, mais aussi afin de consolider mon expérience sur la technologie.",
      "skillsDescription": "react, javascript, html, css, git / github, responsive, seo",
      "date": "202306",
      "githubLink": "https://github.com/gbourgeron/portfolio-p8-oc.git",
      "siteLink": "http://gurvanbourgeron-webdevelopper.empire404.tf/",
      "projectType": "Formation",
      "workType": ["frontend"],
      "image": "imgProjects/portfolio.jpg"
    }
  ]
  